* Выполнение диплома


** DONE Заполнить задание на диплом

*** DONE Определиться что у меня за устройство
:LOGBOOK:
CLOCK: [2025-02-27 Чт 14:16]--[2025-02-27 Чт 15:10] =>  0:54
:END:

Я решил, что у меня будет полётный контроллер.
*** DONE Выписать ГОСТы, которые подходят
:LOGBOOK:
CLOCK: [2025-02-27 Чт 16:57]--[2025-02-27 Чт 17:21] =>  0:24
:END:

>>> ГОСТы по полётным контроллерам

*** DONE Выписать параметры электронной схемы
:LOGBOOK:
CLOCK: [2025-02-27 Чт 17:37]--[2025-02-27 Чт 18:08] =>  0:31
:END:

*** DONE Отредактировать лист задания
:LOGBOOK:
CLOCK: [2025-02-27 Thu 19:41]--[2025-02-27 Thu 19:54] =>  0:13
:END:

** Письма по диплому / email
:LOGBOOK:
CLOCK: [2025-05-30 Fri 18:29]--[2025-05-30 Fri 18:36] =>  0:07
CLOCK: [2025-05-30 Fri 06:13]--[2025-05-30 Fri 06:24] =>  0:11
CLOCK: [2025-05-30 Fri 06:12]--[2025-05-30 Fri 06:13] =>  0:01
CLOCK: [2025-05-25 Sun 19:30]--[2025-05-25 Sun 19:35] =>  0:05
CLOCK: [2025-02-27 Thu 19:56]--[2025-02-27 Thu 20:31] =>  0:35
:END:


** DONE Перевод статьи из журнала
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:58]--[2025-03-11 Вт 22:00] =>  0:02
CLOCK: [2025-03-11 Вт 21:50]--[2025-03-11 Вт 21:58] =>  0:08
CLOCK: [2025-03-11 Вт 21:37]--[2025-03-11 Вт 21:49] =>  0:12
CLOCK: [2025-03-11 Вт 17:43]--[2025-03-11 Вт 17:52] =>  0:09
CLOCK: [2025-03-11 Вт 16:55]--[2025-03-11 Вт 17:39] =>  0:44
CLOCK: [2025-03-11 Вт 17:53]--[2025-03-11 Вт 18:08] =>  0:15
CLOCK: [2025-03-11 Вт 18:13]--[2025-03-11 Вт 18:25] =>  0:12
CLOCK: [2025-03-11 Вт 18:28]--[2025-03-11 Вт 18:49] =>  0:21
CLOCK: [2025-03-11 Вт 19:18]--[2025-03-11 Вт 19:35] =>  0:17
CLOCK: [2025-03-11 Вт 19:56]--[2025-03-11 Вт 20:14] =>  0:18
CLOCK: [2025-03-11 Вт 20:20]--[2025-03-11 Вт 20:36] =>  0:16
CLOCK: [2025-03-11 Вт 21:04]--[2025-03-11 Вт 21:12] =>  0:08
:END:


** Доработка принципиальной схемы
:LOGBOOK:
CLOCK: [2025-05-28 Wed 09:45]--[2025-05-28 Wed 10:08] =>  0:23
CLOCK: [2025-05-27 Tue 13:22]--[2025-05-27 Tue 14:28] =>  1:06
CLOCK: [2025-05-27 Tue 12:36]--[2025-05-27 Tue 13:16] =>  0:40
CLOCK: [2025-05-08 Чт 16:41]--[2025-05-08 Чт 16:53] =>  0:12
CLOCK: [2025-05-08 Чт 16:04]--[2025-05-08 Чт 16:08] =>  0:04
:END:



*** DONE Развернуть схему на весь лист А2
:LOGBOOK:
CLOCK: [2025-03-22 Сб 15:57]--[2025-03-22 Сб 16:28] =>  0:31
CLOCK: [2025-03-20 Чт 23:30]--[2025-03-20 Чт 23:59] =>  0:29
CLOCK: [2025-03-19 Ср 21:13]--[2025-03-19 Ср 21:43] =>  0:30
:END:



*** DONE Перерисовать LM3852 как стабилитрон с двумя выводами
:LOGBOOK:
CLOCK: [2025-03-23 Вс 20:04]--[2025-03-23 Вс 20:19] =>  0:15
:END:

*** NGMI Перерисовать стабилизатор напряжени DA1 по ГОСТ
:LOGBOOK:
CLOCK: [2025-03-23 Вс 20:25]--[2025-03-23 Вс 20:39] =>  0:14
:END:




** Придумать как соеденить Э1 и Э3 на одном листе
:LOGBOOK:
CLOCK: [2025-06-02 Mon 19:20]--[2025-06-02 Mon 20:20] => 1:00
CLOCK: [2025-05-04 Вс 16:18]--[2025-05-04 Вс 16:23] =>  0:05
:END:
Cкорей всего с помощью inkscape или pdfjam.

Я распечатал два листа A2, пришлось склеивать их вместе на одном листе
пергамента, размера А1.


** Доработка структурной схемы
:LOGBOOK:
CLOCK: [2025-05-28 Wed 09:24]--[2025-05-28 Wed 09:43] =>  0:19
CLOCK: [2025-05-26 Mon 19:53]--[2025-05-26 Mon 20:00] =>  0:07
CLOCK: [2025-03-23 Вс 16:39]--[2025-03-23 Вс 16:51] =>  0:12
CLOCK: [2025-03-23 Вс 16:18]--[2025-03-23 Вс 16:26] =>  0:08
CLOCK: [2025-03-23 Вс 16:00]--[2025-03-23 Вс 16:11] =>  0:11
:END:

** Найти (настоящий) децимальный номер для полётного контроллера
:LOGBOOK:
CLOCK: [2025-04-27 Вс 21:15]--[2025-04-27 Вс 21:36] =>  0:21
CLOCK: [2025-03-23 Вс 17:00]--[2025-03-23 Вс 17:33] =>  0:33
:END:

Децимальный номер должен состаять из 6 цифр.
+https://prilan.ru/eskd/46/+
+https://prilan.ru/eskd/46/468/4683/46832/+


https://electronix.ru/forum/topic/199595-klassifikator-eskd-klass-46/

[[file:~/Projects/6sem_coursework/paper/part_1_1.tex::Этот код ГУИР 467993.013. Здесь ГУИР это код предприятия, а 013 порядковый регистрационный номер,][Децимальный номер из курсового шестого семестра]]: 467993.013




** Доработка перечня элементов
:LOGBOOK:
CLOCK: [2025-06-02 Mon 10:29]--[2025-06-02 Mon 10:35] =>  0:06
CLOCK: [2025-05-25 Sun 19:27]--[2025-05-25 Sun 19:29] =>  0:02
CLOCK: [2025-05-25 Sun 19:00]--[2025-05-25 Sun 19:09] =>  0:09
CLOCK: [2025-05-25 Sun 18:48]--[2025-05-25 Sun 18:58] =>  0:10
CLOCK: [2025-05-24 Sat 16:02]--[2025-05-24 Sat 16:23] =>  0:21
CLOCK: [2025-05-23 Fri 20:26]--[2025-05-23 Fri 21:18] =>  0:52
CLOCK: [2025-05-17 Sat 17:40]--[2025-05-17 Sat 18:06] =>  0:26
CLOCK: [2025-05-09 Fri 16:16]--[2025-05-09 Fri 16:20] =>  0:04
CLOCK: [2025-05-09 Fri 16:02]--[2025-05-09 Fri 16:15] =>  0:13
CLOCK: [2025-05-08 Чт 19:48]--[2025-05-08 Чт 19:59] =>  0:11
CLOCK: [2025-05-08 Чт 19:34]--[2025-05-08 Чт 19:42] =>  0:08
CLOCK: [2025-05-08 Чт 18:56]--[2025-05-08 Чт 19:18] =>  0:22
CLOCK: [2025-03-23 Вс 22:07]--[2025-03-23 Вс 22:13] =>  0:06
CLOCK: [2025-03-23 Вс 21:37]--[2025-03-23 Вс 21:42] =>  0:05
:END:

*** DONE Найти значение для диодов шотки

** DONE Отчёт по преддипломной практике

*** DONE Вписать ФИО руководителя практики от предприятия

Руководитель:
Острога Дмитрий Викторович

*** DONE Титульный лист с печатью PlaysDev
DEADLINE: <2025-03-21 Пт>

** DONE План-проспект дипломного проекта.
:LOGBOOK:
CLOCK: [2025-03-25 Вт 12:28]--[2025-03-25 Вт 12:35] =>  0:07
CLOCK: [2025-03-25 Вт 17:46]--[2025-03-25 Вт 17:52] =>  0:06
CLOCK: [2025-03-25 Вт 17:04]--[2025-03-25 Вт 17:22] =>  0:18
CLOCK: [2025-03-25 Вт 16:05]--[2025-03-25 Вт 16:58] =>  0:53
CLOCK: [2025-03-25 Вт 15:25]--[2025-03-25 Вт 15:52] =>  0:27
CLOCK: [2025-03-25 Вт 14:17]--[2025-03-25 Вт 14:21] =>  0:04
CLOCK: [2025-03-25 Вт 13:52]--[2025-03-25 Вт 14:05] =>  0:13
CLOCK: [2025-03-25 Вт 13:11]--[2025-03-25 Вт 13:23] =>  0:12
CLOCK: [2025-03-25 Вт 12:59]--[2025-03-25 Вт 13:10] =>  0:11
CLOCK: [2025-03-25 Вт 12:56]--[2025-03-25 Вт 12:58] =>  0:02
:END:


https://t-j.ru/guide/how-to-plan-diplom/




** DONE Техническое задание
:LOGBOOK:
CLOCK: [2025-03-26 Ср 21:15]--[2025-03-26 Ср 21:40] =>  0:25
CLOCK: [2025-03-26 Ср 20:33]--[2025-03-26 Ср 20:45] =>  0:12
CLOCK: [2025-03-26 Ср 17:33]--[2025-03-26 Ср 17:44] =>  0:11
CLOCK: [2025-03-26 Ср 16:32]--[2025-03-26 Ср 16:39] =>  0:07
CLOCK: [2025-03-26 Ср 16:26]--[2025-03-26 Ср 16:29] =>  0:03
CLOCK: [2025-03-26 Ср 16:16]--[2025-03-26 Ср 16:21] =>  0:05
CLOCK: [2025-03-26 Ср 16:00]--[2025-03-26 Ср 16:14] =>  0:14
CLOCK: [2025-03-26 Ср 15:48]--[2025-03-26 Ср 15:56] =>  0:08
CLOCK: [2025-03-26 Ср 15:43]--[2025-03-26 Ср 15:46] =>  0:03
:END:



** DONE Забрать задание на диплом
:LOGBOOK:
CLOCK: [2025-03-25 Вт 10:58]--[2025-03-25 Вт 12:07] =>  1:09
:END:

Время занявшее у меня сходить до университета пешком, один раз
подъехав на сотом.


** Проектирование


*** Трассировка печатной платы \ работа в KiCAD
:LOGBOOK:
CLOCK: [2025-05-30 Fri 05:36]--[2025-05-30 Fri 05:50] =>  0:14
CLOCK: [2025-05-26 Mon 13:51]--[2025-05-26 Mon 14:07] =>  0:16
CLOCK: [2025-05-26 Mon 12:52]--[2025-05-26 Mon 13:03] =>  0:11
CLOCK: [2025-05-26 Mon 02:47]--[2025-05-26 Mon 02:58] =>  0:11
CLOCK: [2025-05-25 Sun 19:47]--[2025-05-25 Sun 20:44] =>  0:57
CLOCK: [2025-05-25 Sun 19:13]--[2025-05-25 Sun 19:25] =>  0:12
CLOCK: [2025-05-18 Sun 00:48]--[2025-05-18 Sun 01:13] =>  0:34
CLOCK: [2025-05-18 Sun 00:34]--[2025-05-18 Sun 00:47] =>  0:13
CLOCK: [2025-05-17 Sat 23:18]--[2025-05-17 Sat 23:46] =>  0:28
CLOCK: [2025-05-17 Sat 22:11]--[2025-05-17 Sat 22:41] =>  0:30
CLOCK: [2025-05-17 Sat 21:47]--[2025-05-17 Sat 22:06] =>  0:19
CLOCK: [2025-05-17 Sat 21:42]--[2025-05-17 Sat 21:47] =>  0:05
:END:


*** Корпус печатной платы
** Моделирование
*** Установить
**** COMSOL Multiphysics / Linux
:LOGBOOK:
CLOCK: [2025-03-27 Чт 23:35]--[2025-03-27 Чт 23:53] =>  0:18
:END:

**** Ansys workbench  / Linux

**** COMSOL Multiphysics  / Windows
:LOGBOOK:
CLOCK: [2025-05-03 Sat 13:29]--[2025-05-03 Sat 13:55] =>  0:26
:END:

**** Ansys workbench / Windows
:LOGBOOK:
CLOCK: [2025-05-12 Mon 19:01]--[2025-05-12 Mon 20:23] =>  1:22
CLOCK: [2025-05-12 Mon 18:03]--[2025-05-12 Mon 18:42] =>  0:39
:END:

**** Solidworks
:LOGBOOK:
CLOCK: [2025-05-12 Mon 15:59]--[2025-05-12 Mon 17:30] =>  1:31
:END:

*** упрощение модели
:LOGBOOK:
CLOCK: [2025-06-05 Thu 12:35]--[2025-06-05 Thu 12:56] =>  0:21
CLOCK: [2025-06-04 Wed 15:56]--[2025-06-04 Wed 17:10] =>  1:14
CLOCK: [2025-06-04 Wed 14:14]--[2025-06-04 Wed 15:03] =>  0:49
CLOCK: [2025-06-03 Tue 16:46]--[2025-06-03 Tue 16:57] =>  0:11
CLOCK: [2025-06-03 Tue 14:43]--[2025-06-03 Tue 16:35] =>  1:52
CLOCK: [2025-06-03 Tue 12:36]--[2025-06-03 Tue 13:40] =>  1:04
CLOCK: [2025-06-03 Tue 11:14]--[2025-06-03 Tue 11:54] =>  0:40
CLOCK: [2025-06-02 Mon 12:58]--[2025-06-02 Mon 14:55] =>  1:57
CLOCK: [2025-06-01 Sun 17:20]--[2025-06-01 Sun 19:40] =>  2:20
CLOCK: [2025-05-30 Fri 07:23]--[2025-05-30 Fri 07:28] =>  0:05
CLOCK: [2025-05-30 Fri 07:06]--[2025-05-30 Fri 07:23] =>  0:17
CLOCK: [2025-05-18 Sun 18:11]--[2025-05-18 Sun 18:51] =>  0:40
:END:


*** Скрипт на пайтоне
:LOGBOOK:
CLOCK: [2025-05-18 Sun 20:39]--[2025-05-18 Sun 21:31] =>  0:52
CLOCK: [2025-05-18 Sun 19:17]--[2025-05-18 Sun 20:09] =>  0:52
:END:

Который выводит список всех трёхмерных моделях, используемых в печатной плате.

*** Выбор материала
:LOGBOOK:
CLOCK: [2025-05-30 Fri 01:00]--[2025-05-30 01:55] => 0:55
:END:

+AD255C-IM Laminate+
FR4

*** Моделирование в программах
**** COMSOL Multiphysics
***** Eigenfrequency
:LOGBOOK:
CLOCK: [2025-06-05 Thu 13:01]--[2025-06-05 Thu 13:25] =>  0:24
CLOCK: [2025-06-04 Wed 17:11]--[2025-06-04 Wed 17:16] =>  0:05
:END:

**** Ansys workbench
**** Solidworks simulation

** Перенос в записку того что ещё можно перенести из курсового
:LOGBOOK:
CLOCK: [2025-05-04 Вс 18:54]--[2025-05-04 Вс 18:59] =>  0:05
CLOCK: [2025-05-02 Пт 12:08]--[2025-05-02 Пт 12:29] =>  0:21
CLOCK: [2025-03-27 Чт 17:18]--[2025-03-27 Чт 17:19] =>  0:01
CLOCK: [2025-03-27 Чт 16:56]--[2025-03-27 Чт 17:11] =>  0:15
CLOCK: [2025-03-27 Чт 15:57]--[2025-03-27 Чт 16:20] =>  0:23
:END:

Можно перенести расчёт надёжности.

** Разделы пояснительной записки диплома
:LOGBOOK:
CLOCK: [2025-03-27 Чт 13:29]--[2025-03-27 Чт 13:54] =>  0:25
CLOCK: [2025-03-27 Чт 13:17]--[2025-03-27 Чт 13:22] =>  0:05
:END:


*** Анализ литературно патентных исследований

**** Обзор методов и средств управления двигателями мультироторных летательных аппаратов
:LOGBOOK:
CLOCK: [2025-05-02 Пт 12:56]--[2025-05-02 Пт 13:10] =>  0:14
CLOCK: [2025-03-27 Чт 18:02]--[2025-03-27 Чт 18:15] =>  0:13
CLOCK: [2025-03-27 Чт 15:52]--[2025-03-27 Чт 15:55] =>  0:03
CLOCK: [2025-03-27 Чт 14:13]--[2025-03-27 Чт 14:17] =>  0:04
:END:

**** Анализ патентных исследований
:LOGBOOK:
CLOCK: [2025-05-04 Вс 17:56]--[2025-05-04 Вс 18:10] =>  0:14
CLOCK: [2025-05-04 Вс 17:17]--[2025-05-04 Вс 17:27] =>  0:10
:END:

https://worldwide.espacenet.com/patent/search?q=%22flight%20controller%22

https://worldwide.espacenet.com/patent/search?f=cc%3Ain%3Dus%2Cru&q=nftxt%20%3D%20%22flight%20controller%22

***** Патент 1

***** Патент 2

***** Патент 3

***** Патент 4

***** Патент 5

*** Общетехническое обоснование разработки устройства

**** Анализ исходных данных

**** Формирование основных технических требований к разрабатываемой конструкции

*** Схемотехнический анализ радиоэлектронного средства
**** Описание принципа работы проектируемого радиоэлектронного средства.
**** Расчёт электрических параметров и режимов работы отдельных каскадов проектируемого устройства.
*** Разработка конструкции проектируемого изделия
**** Выбор и обоснование элементной базы
**** Выбор типа электричекского монтажа, элементов крепления и фиксации.
**** Выбор способов обеспечения нормального теплового режима
**** Выбор и обоснование метода изготовления печатной платы
**** Выбор конструкторских решений обеспечивающих удобство ремонта
**** Технология разработки чертежа детали в среде KiCAD
**** Обеспечение требований стандартизации, унификации и технологичности конструкции устройства

*** Расчет параметров проектируемого изделия

**** Расчёт теплового режима.

**** Расчёт на механические воздействия

**** Расчёт конструктивно-технологических параметров печатных плат

**** Расчёт электромагнитной совместимости

**** Полный расчёт надёжности
:LOGBOOK:
CLOCK: [2025-05-17 Sat 19:27]--[2025-05-17 Sat 20:19] =>  0:52
CLOCK: [2025-05-17 Sat 18:15]--[2025-05-17 Sat 18:32] =>  0:17
:END:


*** Моделирование физических процессов, протекающих в проектируемом радиоэлектронном средстве

**** Обоснование выбора ПО

**** Компоненты математического обеспечения

**** Технология построения трехмерных моделей исследуемого устройства

**** Технология моделирования тепловых процессов

**** Технология моделирования движения воздуха в корпусах РЭС

**** Обработка, анализ и интерпертация данных

*** Экономическое обоснование (2-я опроцентовка)
:LOGBOOK:
CLOCK: [2025-05-30 Fri 13:02]--[2025-05-30 Fri 13:17] =>  0:15
CLOCK: [2025-05-21 Wed 14:36]--[2025-05-21 Wed 14:50] =>  0:14
CLOCK: [2025-05-20 Tue 16:33]--[2025-05-20 Tue 16:37] =>  0:04
CLOCK: [2025-05-20 Tue 15:16]--[2025-05-20 Tue 16:08] =>  0:52
CLOCK: [2025-05-16 Fri 21:08]--[2025-05-16 Fri 22:03] =>  0:55
CLOCK: [2025-05-16 Fri 18:48]--[2025-05-16 Fri 20:40] =>  1:52
CLOCK: [2025-05-16 Fri 17:26]--[2025-05-16 Fri 18:38] =>  1:12
CLOCK: [2025-05-16 Fri 16:41]--[2025-05-16 Fri 16:43] =>  0:02
CLOCK: [2025-05-16 Fri 15:39]--[2025-05-16 Fri 16:33] =>  0:54
CLOCK: [2025-05-16 Fri 15:18]--[2025-05-16 Fri 15:26] =>  0:08
CLOCK: [2025-05-14 Wed 14:24]--[2025-05-14 Wed 14:41] =>  0:17
CLOCK: [2025-05-14 Wed 14:01]--[2025-05-14 Wed 14:18] =>  0:17
CLOCK: [2025-05-13 Tue 21:46]--[2025-05-13 Tue 22:02] =>  0:16
CLOCK: [2025-05-13 Tue 21:16]--[2025-05-13 Tue 21:43] =>  0:27
CLOCK: [2025-05-13 Tue 21:02]--[2025-05-13 Tue 21:07] =>  0:05
CLOCK: [2025-05-13 Tue 20:10]--[2025-05-13 Tue 20:53] =>  0:43
CLOCK: [2025-05-13 Tue 18:18]--[2025-05-13 Tue 18:25] =>  0:07
CLOCK: [2025-05-13 Tue 17:48]--[2025-05-13 Tue 18:06] =>  0:18
CLOCK: [2025-05-13 Tue 16:20]--[2025-05-13 Tue 17:03] =>  0:43
CLOCK: [2025-05-13 Tue 15:30]--[2025-05-13 Tue 15:54] =>  0:24
CLOCK: [2025-05-11 Sun 17:14]--[2025-05-11 Sun 17:58] =>  0:44
CLOCK: [2025-05-11 Sun 17:03]--[2025-05-11 Sun 17:06] =>  0:03
CLOCK: [2025-05-11 Sun 16:45]--[2025-05-11 Sun 16:48] =>  0:03
CLOCK: [2025-05-11 Sun 15:40]--[2025-05-11 Sun 16:07] =>  0:27
CLOCK: [2025-05-10 Sat 21:29]--[2025-05-10 Sat 21:37] =>  0:08
CLOCK: [2025-05-10 Sat 20:52]--[2025-05-10 Sat 21:05] =>  0:13
CLOCK: [2025-05-10 Sat 20:35]--[2025-05-10 Sat 20:47] =>  0:12
CLOCK: [2025-05-10 Sat 19:42]--[2025-05-10 Sat 20:16] =>  0:34
CLOCK: [2025-05-10 Sat 17:42]--[2025-05-10 Sat 17:57] =>  0:15
CLOCK: [2025-05-10 Sat 16:41]--[2025-05-10 Sat 16:52] =>  0:11
CLOCK: [2025-05-10 Sat 16:13]--[2025-05-10 Sat 16:28] =>  0:15
CLOCK: [2025-05-09 Fri 15:30]--[2025-05-09 Fri 15:37] =>  0:07
CLOCK: [2025-05-09 Fri 15:14]--[2025-05-09 Fri 15:16] =>  0:02
CLOCK: [2025-05-08 Чт 15:56]--[2025-05-08 Чт 15:57] =>  0:01
CLOCK: [2025-05-08 Чт 15:14]--[2025-05-08 Чт 15:21] =>  0:07
CLOCK: [2025-05-06 Вт 15:08]--[2025-05-06 Вт 15:19] =>  0:11
CLOCK: [2025-05-06 Вт 14:23]--[2025-05-06 Вт 15:06] =>  0:43
CLOCK: [2025-05-06 Вт 13:51]--[2025-05-06 Вт 14:03] =>  0:12
CLOCK: [2025-05-06 Вт 13:13]--[2025-05-06 Вт 13:27] =>  0:14
:END:
ЭКОНОМИЧЕСКОЕ ОБОСНОВАНИЕ РАЗРАБОТКИ И ПРОИЗВОДСТВА НОВОГО ИЗДЕЛИЯ

https://www.bsuir.by/m/12_100229_1_161144.pdf

https://www.bsuir.by/m/12_100229_1_147164.pdf

>>> экономическое обоснование

| 1) кто будет пользователем Вашей разработки                                                                              | Разработчики БПЛА                     |
| 2) какую проблему этого пользователя она будет решать                                                                    | Проблема управления двигателями       |
| 3) какие существуют конкурентные аналоги и альтернативы                                                                  | TODO                                  |
| 4) почему Ваша разработка окажется для пользователя более предпочтительной по сравнению с этими аналогами/альтернативами | Почему моя разработка предпочтительна |



** Поиск источников
:LOGBOOK:
CLOCK: [2025-03-25 Вт 12:51]--[2025-03-25 Вт 12:54] =>  0:03
:END:

>>> диплом

https://github.com/stars/artsi0m/lists/flight-controller-diploma

** изменения в git / README / ещё что-то для репозитория
:LOGBOOK:
CLOCK: [2025-06-05 Thu 21:51]--[2025-06-05 Thu 21:56] =>  0:05
CLOCK: [2025-06-05 Thu 15:52]--[2025-06-05 Thu 15:58] =>  0:06
CLOCK: [2025-06-05 Thu 13:36]--[2025-06-05 Thu 13:40] =>  0:04
CLOCK: [2025-05-30 Fri 06:40]--[2025-05-30 Fri 06:45] =>  0:05
CLOCK: [2025-05-30 Fri 06:07]--[2025-05-30 Fri 06:12] =>  0:05
CLOCK: [2025-05-25 Sun 20:45]--[2025-05-25 Sun 20:47] =>  0:02
CLOCK: [2025-05-25 Sun 19:35]--[2025-05-25 Sun 19:38] =>  0:03
CLOCK: [2025-05-21 Wed 14:51]--[2025-05-21 Wed 14:52] =>  0:01
CLOCK: [2025-03-25 Вт 18:14]--[2025-03-25 Вт 18:17] =>  0:03
CLOCK: [2025-03-25 Вт 12:47]--[2025-03-25 Вт 12:48] =>  0:01
CLOCK: [2025-03-25 Вт 12:35]--[2025-03-25 Вт 12:37] =>  0:02
:END:

** Проверка орфографии (spellcheck)
:LOGBOOK:
CLOCK: [2025-03-11 Вт 22:00]--[2025-03-11 Вт 22:14] =>  0:14
CLOCK: [2025-03-26 Ср 21:41]--[2025-03-26 Ср 21:50] =>  0:09
CLOCK: [2025-03-25 Вт 17:55]--[2025-03-25 Вт 17:58] =>  0:03
CLOCK: [2025-03-25 Вт 14:11]--[2025-03-25 Вт 14:16] =>  0:05
CLOCK: [2025-03-25 Вт 14:05]--[2025-03-25 Вт 14:07] =>  0:02
:END:

About hunspell on windows:
https://www.gnu.org/software/emacs/manual/html_node/efaq-w32/Spell-check.html

** Форматирование пояснительной записки

*** Ручное форматирование
:LOGBOOK:
CLOCK: [2025-03-25 Вт 18:06]--[2025-03-25 Вт 18:09] =>  0:03
CLOCK: [2025-03-25 Вт 17:59]--[2025-03-25 Вт 18:03] =>  0:04
:END:

*** Доработка latex класса

*** Переезд записки с xelatex на luatex


** Нормоконтроль

*** DONE Написать Ефремовой
:LOGBOOK:
CLOCK: [2025-03-26 Ср 15:07]--[2025-03-26 Ср 15:08] =>  0:01
CLOCK: [2025-03-26 Ср 14:05]--[2025-03-26 Ср 14:08] =>  0:03
:END:


** Исправление недочётов с первой опроцентовки

*** TODO Увеличить шрифт пинов у микроконтроллера

*** TODO Найти УГО пищалки и если оно отличается, то перерисовать

*** DONE Заменить на структурной схеме Э3 на Э1

*** TODO В перечне убрать строчки в конце листа

*** TODO В перечне штырьевые разъёмы должны обозначаться своим типом

*** TODO Исправить опечатку в целях и назначениях разработки в ТЗ

*** DONE В ТЗ указать журнал там где «слова другая документация»

*** DONE В ТЗ 100ВТ заменить на 100 Вт.

*** TODO Выполнить расчёт для тразнистора рядом с пищалкой в пункте 3.2

*** DONE Прислать перевод статьи из журнала на почту

*** DONE Переанатировать схему
:LOGBOOK:
CLOCK: [2025-04-27 Вс 20:47]--[2025-04-27 Вс 20:51] =>  0:04
:END:

*** TODO Cделать справку о патентном поиске


** Чертежи (кроме Э1 и Э3)

*** Поставить AutoCAD
:LOGBOOK:
CLOCK: [2025-05-20 Tue 16:44]--[2025-05-20 Tue 17:11] =>  0:27
:END:

*** Экспорт dxf из kicad
:LOGBOOK:
CLOCK: [2025-05-26 Mon 14:07]--[2025-05-26 Mon 14:19] =>  0:12
CLOCK: [2025-05-26 Mon 13:07]--[2025-05-26 Mon 13:34] =>  0:27
CLOCK: [2025-05-25 Sun 21:25]--[2025-05-25 Sun 21:43] =>  0:18
CLOCK: [2025-05-25 Sun 20:47]--[2025-05-25 Sun 20:52] =>  0:05
CLOCK: [2025-05-20 Tue 17:14]--[2025-05-20 Tue 17:25] =>  0:11
:END:

Слои для экспорта:
- На B.Cu
  - B.Cu
  - Edge.Cuts 
- На F. Cu
  - F.Cu
  - F.Silkscreen
  - Edge.Cuts


*** Чертёж печатной платы
:LOGBOOK:
CLOCK: [2025-05-30 Fri 12:56]--[2025-05-30 Fri 13:02] =>  0:06
CLOCK: [2025-05-30 Fri 02:00]--[2025-05-30 Fri 02:18] =>  0:18
CLOCK: [2025-05-30 Fri 02:18]--[2025-05-30 Fri 02:28] =>  0:10
CLOCK: [2025-05-29 Thu 16:11]--[2025-05-29 Thu 18:03] =>  1:52
CLOCK: [2025-05-28 Wed 19:54]--[2025-05-28 Wed 20:48] =>  0:54
CLOCK: [2025-05-28 Wed 17:31]--[2025-05-28 Wed 19:23] =>  1:52
CLOCK: [2025-05-28 Wed 15:21]--[2025-05-28 Wed 15:38] =>  0:17
CLOCK: [2025-05-28 Wed 14:06]--[2025-05-28 Wed 14:09] =>  0:03
CLOCK: [2025-05-28 Wed 12:09]--[2025-05-28 Wed 14:01] =>  1:52
CLOCK: [2025-05-28 Wed 10:53]--[2025-05-28 Wed 11:10] =>  0:17
CLOCK: [2025-05-26 Mon 21:56]--[2025-05-26 Mon 23:48] =>  1:52
CLOCK: [2025-05-26 Mon 20:07]--[2025-05-26 Mon 21:23] =>  1:16
CLOCK: [2025-05-26 Mon 19:31]--[2025-05-26 Mon 19:52] =>  0:21
CLOCK: [2025-05-26 Mon 17:12]--[2025-05-26 Mon 19:04] =>  1:52
CLOCK: [2025-05-26 Mon 15:11]--[2025-05-26 Mon 15:33] =>  0:22
CLOCK: [2025-05-26 Mon 14:20]--[2025-05-26 Mon 14:44] =>  0:24
CLOCK: [2025-05-26 Mon 13:35]--[2025-05-26 Mon 13:51] =>  0:16
CLOCK: [2025-05-25 Sun 21:43]--[2025-05-25 Sun 22:15] =>  0:32
CLOCK: [2025-05-24 Sat 21:13]--[2025-05-24 Sat 21:31] =>  0:18
CLOCK: [2025-05-24 Sat 16:23]--[2025-05-24 Sat 16:54] =>  0:31
CLOCK: [2025-05-24 Sat 14:33]--[2025-05-24 Sat 15:25] =>  0:52
CLOCK: [2025-05-21 Wed 17:02]--[2025-05-21 Wed 17:54] =>  0:52
CLOCK: [2025-05-21 Wed 15:05]--[2025-05-21 Wed 15:57] =>  0:52
:END:


*** Cборочный чертеж изделия
:LOGBOOK:
CLOCK: [2025-05-30 Fri 16:30]--[2025-05-30 Fri 18:22] =>  1:52
CLOCK: [2025-05-30 Fri 13:40]--[2025-05-30 Fri 14:48] =>  1:08
CLOCK: [2025-05-30 Fri 06:04]--[2025-05-30 Fri 06:07] =>  0:03
:END:

**** Экспорт из dxf
- F.Fab
  - Edge.Cuts
  - F.Fab
  - F.Courtyard
- F.Silkscreen
  - Edge.Cuts
  - F.Silkscreen.
  - F.Courtyard
    
*** Чертежи нестандартных деталей (корпус)

*** Скрипт для массового добавления эс-выражений


** Плакаты

*** Плакат с результатами моделирования
:LOGBOOK:
CLOCK: [2025-06-05 Thu 14:51]--[2025-06-05 Thu 15:38] =>  0:47
CLOCK: [2025-06-05 Thu 14:38]--[2025-06-05 Thu 14:51] =>  0:13
CLOCK: [2025-06-05 Thu 13:41]--[2025-06-05 Thu 14:21] =>  0:40
:END:

** Спецификации

*** Редактирование класса спецификации
:LOGBOOK:
CLOCK: [2025-06-05 Thu 20:59]--[2025-06-05 Thu 21:38] =>  0:39
:END:

*** Спецификация на весь проект
:LOGBOOK:
CLOCK: [2025-06-05 Thu 21:58]--[2025-06-05 Thu 22:19] =>  0:21
:END:

*** Спецификация на устройство
